Autodesk.Revit.DB.SpecialType
Since:
2014
An enumerated type listing special types that can appear in an Autodesk.Revit.DB.ExportLayerTable.
These types do not represent an independent category in Revit, but can be mapped to specific layers on export.
Since:
2014

Autodesk.Revit.DB.SpecialType.RetainingWall
The special type representing retaining walls.

Autodesk.Revit.DB.SpecialType.FoundationWall
The special type representing foundation walls.

Autodesk.Revit.DB.SpecialType.ExteriorWall
The special type representing exterior walls.

Autodesk.Revit.DB.SpecialType.InteriorWall
The special type representing interior walls.

Autodesk.Revit.DB.SpecialType.Default
The default value for most Revit categories and subcategories.